; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	spectrograph0 - mode
	image2 - mode
	image1 - mode
	spectrograph3 - mode
	thermograph6 - mode
	spectrograph5 - mode
	infrared4 - mode
	GroundStation5 - direction
	Star7 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star0 - direction
	Star3 - direction
	GroundStation2 - direction
	Star6 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 spectrograph5)
	(supports instrument0 infrared4)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 spectrograph3)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star3)
	(supports instrument2 image2)
	(supports instrument2 spectrograph5)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument3 spectrograph5)
	(supports instrument3 thermograph6)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 Star6)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
)
(:goal (and
	(pointing satellite1 Star7)
	(have_image Phenomenon8 thermograph6)
	(have_image Phenomenon8 image1)
	(have_image Star9 infrared4)
	(have_image Star9 spectrograph5)
	(have_image Phenomenon10 spectrograph3)
	(have_image Phenomenon10 spectrograph0)
	(have_image Planet11 image2)
	(have_image Planet11 image1)
	(have_image Star12 spectrograph3)
	(have_image Star12 image2)
))

)

; plan
1. (turn_to satellite0 groundstation1 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 11
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 11
3. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 11
4. (turn_to satellite0 star9 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star9)
   goals met: 0 of 11
5. (take_image satellite0 star9 instrument0 spectrograph5)
   added: (have_image star9 spectrograph5)
   goals met: 1 of 11
6. (take_image satellite0 star9 instrument0 infrared4)
   added: (have_image star9 infrared4)
   goals met: 2 of 11
7. (turn_to satellite0 groundstation1 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation1)
   goals met: 2 of 11
8. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 11
9. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 2 of 11
10. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 11
11. (calibrate satellite1 instrument3 star6)
   added: (calibrated instrument3)
   goals met: 2 of 11
12. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 2 of 11
13. (turn_to satellite0 phenomenon10 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 11
14. (take_image satellite0 phenomenon10 instrument1 spectrograph3)
   added: (have_image phenomenon10 spectrograph3)
   goals met: 3 of 11
15. (turn_to satellite0 phenomenon8 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 11
16. (take_image satellite0 phenomenon8 instrument1 image1)
   added: (have_image phenomenon8 image1)
   goals met: 4 of 11
17. (turn_to satellite0 planet11 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet11)
   goals met: 4 of 11
18. (take_image satellite0 planet11 instrument1 image1)
   added: (have_image planet11 image1)
   goals met: 5 of 11
19. (turn_to satellite0 star12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star12)
   goals met: 5 of 11
20. (take_image satellite0 star12 instrument1 spectrograph3)
   added: (have_image star12 spectrograph3)
   goals met: 6 of 11
21. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 6 of 11
22. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 6 of 11
23. (turn_to satellite0 star0 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star0)
   goals met: 6 of 11
24. (calibrate satellite0 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 6 of 11
25. (turn_to satellite0 phenomenon10 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon10)
   goals met: 6 of 11
26. (take_image satellite0 phenomenon10 instrument2 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 7 of 11
27. (turn_to satellite0 planet11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet11)
   goals met: 7 of 11
28. (take_image satellite0 planet11 instrument2 image2)
   added: (have_image planet11 image2)
   goals met: 8 of 11
29. (turn_to satellite0 star12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star12)
   goals met: 8 of 11
30. (take_image satellite0 star12 instrument2 image2)
   added: (have_image star12 image2)
   goals met: 9 of 11
31. (turn_to satellite1 phenomenon8 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon8)
   goals met: 9 of 11
32. (take_image satellite1 phenomenon8 instrument3 thermograph6)
   added: (have_image phenomenon8 thermograph6)
   goals met: 10 of 11
33. (turn_to satellite1 star7 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star7)
   goals met: 11 of 11
